cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/services'

brew 'ack'
brew 'coreutils'
brew 'dark-mode'
brew 'go'
brew 'git'
brew 'grc'
brew 'imagemagick', args: ['with-webp']
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'redis'
brew 'mongodb'
brew 'postgresql'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'speedtest_cli'
brew 'spaceman-diff'
brew 'spark'
brew 'ssh-copy-id'
brew 'testssl'
brew 'tree'
brew 'unrar'
brew 'wget'
brew 'webkit2png'
brew 'yarn'
brew 'youtube-dl'

cask '1password'
cask 'adium'
cask 'atom'
cask 'firefox'
cask 'google-chrome'
cask 'handbrake'
cask 'slack'
cask 'steam'
cask 'transmission'
cask 'tunnelbear'
cask 'vlc'
