cask_args appdir: '/Applications'

# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/php'
tap 'homebrew/services'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'tree'
brew 'fzf'
brew 'mas'
brew 'trash'
brew 'ack'
brew 'dark-mode'
brew 'unrar'
brew 'ssh-copy-id'
brew 'grc'
brew 'imagemagick', args: ['with-webp']
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'speedtest_cli'
brew 'wget'
brew 'webkit2png'
brew 'youtube-dl'
brew 'asciinema'
brew 'nvm'
brew 'kubectl'
brew 'helm'
brew 'yarn'
brew 'pyenv'
brew 'openssl'
brew 'htop'
brew 'cmake'
brew 'ffmpeg'
brew 'ansible'
brew 'terraform'
brew 'azure-cli'
brew 'watchman'
brew 'cowsay'
brew 'wrk'
brew 'nmap'
brew 'iperf'
brew 'httpie'
brew 'autoconf'

# Development
brew 'python'
brew 'ruby'
brew 'php', args: ['with-debug']
brew 'go'
brew 'node'
brew 'rustup'
# brew 'mariadb'
brew 'redis'
brew 'mongodb-community'
brew 'mysql'
brew 'postgresql'
brew 'nsq'
brew 'rabbitmq'
brew 'httpd'
brew 'nginx-full'

# Apps
cask 'docker'
cask 'minikube'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'google-backup-and-sync'
cask 'gpgtools'
cask 'iterm2'
cask 'shuttle'
cask 'slack'
cask 'torbrowser'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask '1password'
cask 'appcleaner'
cask 'pixel-picker'
cask 'typora'
cask 'adium'
cask 'handbrake'
cask 'transmission'
cask 'tunnelbear'
cask 'browserstacklocal'
cask 'postman'
cask 'react-native-debugger'
cask 'android-studio'
cask 'cocoscreator'
# cask 'steam'
cask 'charles'
cask 'tableplus'
# cask 'mysqlworkbench'
# cask 'sequel-pro'
cask 'telegram'
cask 'whatsapp'
cask 'viber'
cask 'skype'
cask 'tunnelblick'
cask 'spotify'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas 'Byword', id: 420212497
mas 'Gapplin', id: 768053424
mas 'GIPHY Capture. The GIF Maker', id: 668208984
mas 'Spark - Email App by Readdle', id: 1176895641

# mas 'Deckset', id: 847496013
# mas 'Paw', id: 584653203
# mas 'Sip', id: 507257563
# mas '1Password', id: 443987910
# mas 'Sketch', id: 402476602
# mas 'Tweetbot', id: 557168941
